In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('test-groupby.csv')
ts = pd.read_csv('test-groupby-t.csv')

In [2]:
df

    id grade  target     ir  n4
0    0     E       1  19.52   4
1    1     D       0  18.48  10
2    2     D       0  16.98   0
3    3     A       0   7.26   4
4    4     C       0  12.99   2
5    5     A       0   7.99   1
6    6     A       0   7.69   7
7    7     C       0  14.98   4
8    8     C       1  12.99   7
9    9     B       0  10.99   4
10  10     B       0  13.67   6
11  11     E       0  27.27   0
12  12     D       0  20.00   7
13  13     B       0   9.99   2
14  14     A       0   7.91   4
15  15     B       0  10.49   2

In [3]:
ts

   id grade     ir  n4
0  17     B  10.99   3
1  18     E  21.00   2

In [4]:
df.iloc[12]

id        12
grade      D
target     0
ir        20
n4         7
Name: 12, dtype: object

In [5]:
fea = [f for f in df.columns if f not in ['target']]
x_train = df[fea]
x_test = ts[fea]
y_train = df['target']

In [6]:
from sklearn.model_selection import KFold
folds = 2
seed = 2020
kf = KFold(n_splits=folds, shuffle=True, random_state=seed)

train = np.zeros(x_train.shape[0])
test = np.zeros(x_test.shape[0])

cv_scores = []

for i, (train_ind, valid_ind) in enumerate(kf.split(x_train, y_train)):
    print('************************************ {} ************************************'.format(str(i + 1)))
    trn_x, trn_y, val_x, val_y = x_train.iloc[train_ind], y_train[train_ind], x_train.iloc[valid_ind], y_train[valid_ind]

************************************ 1 ************************************
************************************ 2 ************************************

train_ind

In [7]:
trn_x

    id grade     ir  n4
1    1     D  18.48  10
2    2     D  16.98   0
4    4     C  12.99   2
5    5     A   7.99   1
9    9     B  10.99   4
10  10     B  13.67   6
12  12     D  20.00   7
15  15     B  10.49   2

In [8]:
trn_y

1     0
2     0
4     0
5     0
9     0
10    0
12    0
15    0
Name: target, dtype: int64

In [9]:
type(trn_y)

pandas.core.series.Series

In [10]:
val_x

    id grade     ir  n4
0    0     E  19.52   4
3    3     A   7.26   4
6    6     A   7.69   7
7    7     C  14.98   4
8    8     C  12.99   7
11  11     E  27.27   0
13  13     B   9.99   2
14  14     A   7.91   4

### 区分 iloc 和loc

In [11]:
test = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'], index=[0,2,4])
test

   a  b  c
0  1  2  3
2  4  5  6
4  7  8  9

In [12]:
test.iloc[2]

a    7
b    8
c    9
Name: 4, dtype: int32

In [13]:
test.loc[2]

a    4
b    5
c    6
Name: 2, dtype: int32